Revit 2026 API

# NumberSystemGetReferencePick Method

---

Gets the reference curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference GetReferencePick()
```
```vb
Public Function GetReferencePick As Reference
```
```cpp
public:
Reference^ GetReferencePick()
```
```fsharp
member GetReferencePick : unit -> Reference
```

#### Return Value

Reference The pick of reference curve.

#### Reference

NumberSystem Class

Autodesk.Revit.DB Namespace